sim/pimple_cylinder/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "1000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
14620
(
1.04477e-09
1.04605e-09
1.04721e-09
1.04825e-09
1.04918e-09
1.05001e-09
1.05077e-09
1.05144e-09
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 1.0441e-09;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
268
(
1.04418e-09
1.04435e-09
1.04451e-09
1.04465e-09
1.04476e-09
1.04484e-09
1.04488e-09
1.0449e-09
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
1.10217e-09
1.08862e-09
1.09204e-09
1.09651e-09
1.09513e-09
1.09527e-09
1.09309e-09
1.09099e-09
...
)
;
    }
    wall
    {
        type            nutUSpaldingWallFunction;
        value           nonuniform List<scalar> 
200
(
4.49176e-05
4.37548e-05
4.25223e-05
4.12205e-05
3.98502e-05
3.84142e-05
3.69133e-05
3.53486e-05
...
)
;
    }
}


// ************************************************************************* //
