sim/pimple_cylinder/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceScalarField;
    location    "1000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<scalar> 
28926
(
0.0127593
4.32936e-05
-4.17552e-05
0.0127555
0.000114045
-0.000110167
0.0127502
0.000168925
...
)
;

boundaryField
{
    sides
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
-0.0127609
-0.0141008
-0.0155813
-0.0172174
-0.0190252
-0.0210229
-0.0232303
-0.0256694
...
)
;
    }
    topBot
    {
        type            calculated;
        value           nonuniform List<scalar> 
268
(
-2.29878e-06
8.15173e-06
1.74098e-05
2.52785e-05
3.1617e-05
3.5993e-05
3.85546e-05
3.96245e-05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.0130988
0.0144605
0.015968
0.0176198
0.0194482
0.0214563
0.0236756
0.026116
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
